---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsFlexPipeTypeParam
source: html/95122f22-e730-5b7e-c512-8bdbb633e054.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsFlexPipeTypeParam Property

"Flex Pipe"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsFlexPipeTypeParam { get; }
```